UT_Marketplaces.Marketplaces/src/Documents/рар_мп_ПодготовкаФайловПоставки/рар_мп_ПодготовкаФайловПоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>рар_мп_ПодготовкаФайловПоставки</name>
  <attributes>
    <name>рар_мп_АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Реализация</name>
    <type>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
    </type>
  </attributes>
  <tabularSections>
    <name>рар_мп_СписокТоваров</name>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Баркод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_ЯндексМаркет_СписокТоваров</name>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_ТоварыИзЗаказов</name>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Баркод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_Коробки</name>
    <attributes>
      <name>рар_мп_Коробка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>рар_мп_РаспределенныеТовары</name>
    <attributes>
      <name>рар_мп_Коробка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Артикул</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Баркод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Ozon_СопоставленныеТовары/рар_мп_Ozon_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Ozon_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>SKUТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/рар_мп_Wildberries_СопоставленныеТовары/рар_мп_Wildberries_СопоставленныеТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рар_мп_Wildberries_СопоставленныеТовары</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDРазмера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВозможностьСменыЦенДляРазмеров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IDТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Баракод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Documents/рар_мп_ПодготовкаФайловПоставки/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал механизма не доступен'");
        Сообщение.Сообщить();
        //@skip-check module-self-reference
		ЭтотОбъект.Закрыть();
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
    Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал механизма не доступен'");
        Сообщение.Сообщить();
        //@skip-check module-self-reference
		ЭтотОбъект.Закрыть();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Ключ.Пустая() Тогда
		
		АккаунтМаркетплейсаПриИзмененииНаСервере();	
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)     
	
	Если ИмяСобытия = "РазделениеТоваров" Тогда      
		
		Для каждого Товар Из Параметр Цикл
			
			НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();  
			НоваяСтрока.рар_мп_Баркод         = Товар.Баркод;
			НоваяСтрока.рар_мп_Номенклатура   = Товар.Номенклатура;
			НоваяСтрока.рар_мп_Характеристика = Товар.Характеристика;
			НоваяСтрока.рар_мп_Упаковка       = Товар.Упаковка;
			НоваяСтрока.рар_мп_Количество     = Товар.Количество;
			
		КонецЦикла;    
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область СлужебныеПроцедурыИФункцииДляПроверкиПЛС

&НаСервере
Функция ПриПовторномОткрытииНаСервере()
    Возврат Константы.рар_мп_Согласие.Получить();
КонецФункции

#КонецОбласти

//@skip-check module-structure-top-region
#Область ПрочиеПроцедурыФункции

&НаСервере
Функция ОпределитьТекМаркетплейс_Ozon() 
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		Возврат Истина
		
	Иначе  
		
		Возврат Ложь
		
	КонецЕсли;
	
КонецФункции  

&НаСервере
Функция ОпределитьТекМаркетплейс_Wildberries() 
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		Возврат Истина
		
	Иначе  
		
		Возврат Ложь
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ОпределитьТекМаркетплейс_ЯндексМаркет() 
	
	Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		Возврат Истина
		
	Иначе  
		
		Возврат Ложь
		
	КонецЕсли;
	
КонецФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура рар_мп_СписокТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Не ЗначениеЗаполнено(Объект.рар_мп_АккаунтМаркетплейса) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен аккаунт маркетплейса.";
		Сообщение.Сообщить();                      
		
		Отказ = Истина;
		
	КонецЕсли;  
	
КонецПроцедуры  

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура рар_мп_КоробкиВыборСтрокиПриИзменении(Элемент)
	
	Если Элементы.рар_мп_Коробки.ТекущиеДанные <> Неопределено Тогда
		
		//@skip-check bsl-legacy-check-dynamic-feature-access
		НовоеЗначение = Объект.рар_мп_Коробки[Элементы.рар_мп_Коробки.ТекущиеДанные.НомерСтроки-1].ВыборСтроки;
		
		Для Каждого Стр из Объект.рар_мп_Коробки Цикл
			
			Стр.ВыборСтроки = Ложь;    
			
		КонецЦикла;
		
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Объект.рар_мп_Коробки[Элементы.рар_мп_Коробки.ТекущиеДанные.НомерСтроки-1].ВыборСтроки = НовоеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти      

//@skip-check module-structure-top-region
#Область ИзменениеВидимостиРеквизитов   

&НаСервере
Процедура АккаунтМаркетплейсаПриИзмененииНаСервере()     
	
	Объект.рар_мп_Реализация = Документы.ПередачаТоваровХранителю.ПустаяСсылка();
	
	Если ОпределитьТекМаркетплейс_Ozon() Тогда
		
		//Обработка Ozon
		
		Элементы.Группарар_мп_ЯндексМаркет_СписокТоваров.Видимость = Ложь; 

		Элементы.Страница_СписокТоваров.Видимость = Истина;
		
		Элементы.СтраницаРаспределениеТоваровПоКоробкам.Видимость = Ложь;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Артикул.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Баркод.Видимость = Ложь;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Номенклатура.Видимость = Истина;   
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Упаковка.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Характеристика.Видимость = Истина;
		
		Элементы.СоздатьExcelФайлСРаспределеннымиТоварами.Видимость = Ложь;
		
	ИначеЕсли ОпределитьТекМаркетплейс_ЯндексМаркет() Тогда
		
		Элементы.Группарар_мп_ЯндексМаркет_СписокТоваров.Видимость = Истина;   
		
		Элементы.Страница_СписокТоваров.Видимость = Ложь;
		
		Элементы.СтраницаРаспределениеТоваровПоКоробкам.Видимость = Ложь;   
		
		Элементы.СоздатьExcelФайлСРаспределеннымиТоварами.Видимость = Ложь;
		
		
	ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда	
		
		//Обработка Wildberries  
		
		Элементы.Группарар_мп_ЯндексМаркет_СписокТоваров.Видимость = Ложь;
		
		Элементы.СтраницаРаспределениеТоваровПоКоробкам.Видимость = Истина;       

		Элементы.Страница_СписокТоваров.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Артикул.Видимость = Ложь;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Баркод.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Номенклатура.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Упаковка.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Характеристика.Видимость = Истина;
		
		Элементы.рар_мп_ТоварыИзЗаказов.ПодчиненныеЭлементы.рар_мп_ТоварыИзЗаказоврар_мп_Артикул.Видимость = Ложь;   
		
		Элементы.рар_мп_РаспределенныеТовары.ПодчиненныеЭлементы.рар_мп_РаспределенныеТоварырар_мп_Артикул.Видимость = Ложь;
		
		Элементы.СоздатьExcelФайлСРаспределеннымиТоварами.Видимость = Истина;
	Иначе
		
		Элементы.Группарар_мп_ЯндексМаркет_СписокТоваров.Видимость = Истина;
		
		Элементы.СтраницаРаспределениеТоваровПоКоробкам.Видимость = Истина; 
		
		Элементы.Страница_СписокТоваров.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Артикул.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Баркод.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Номенклатура.Видимость = Истина; 
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Упаковка.Видимость = Истина;
		
		Элементы.рар_мп_СписокТоваров.ПодчиненныеЭлементы.рар_мп_СписокТовароврар_мп_Характеристика.Видимость = Истина;
		
		Элементы.рар_мп_ТоварыИзЗаказов.ПодчиненныеЭлементы.рар_мп_ТоварыИзЗаказоврар_мп_Артикул.Видимость = Истина; 
		
		Элементы.рар_мп_РаспределенныеТовары.ПодчиненныеЭлементы.рар_мп_РаспределенныеТоварырар_мп_Артикул.Видимость = Истина;
		
		Элементы.СоздатьExcelФайлСРаспределеннымиТоварами.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура АккаунтМаркетплейсаПриИзменении(Элемент)
	
	АккаунтМаркетплейсаПриИзмененииНаСервере(); 
	
	Объект.рар_мп_СписокТоваров.Очистить();
	Объект.рар_мп_ЯндексМаркет_СписокТоваров.Очистить();
	Объект.рар_мп_ТоварыИзЗаказов.Очистить();
	Объект.рар_мп_Коробки.Очистить();
	Объект.рар_мп_РаспределенныеТовары.Очистить();  
	
КонецПроцедуры

#КонецОбласти      

//@skip-check module-structure-top-region
#Область ИзменениеАртикулаВСпискеТоваров

&НаСервере
Функция ПолучитьНоменклатуруПоАртикулу(Артикул)
	
	Если ОпределитьТекМаркетплейс_Ozon() Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Ozon_СопоставленныеТовары.Номенклатура КАК Номенклатура,     
		|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Ozon_СопоставленныеТовары.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт = &Аккаунт
		|	И рар_мп_Ozon_СопоставленныеТовары.Артикул = &Артикул"; 
		
		Запрос.УстановитьПараметр("Аккаунт", Объект.рар_мп_АккаунтМаркетплейса);  
		Запрос.УстановитьПараметр("Артикул", Артикул);
		
	ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Wildberries_СопоставленныеТовары.Номенклатура КАК Номенклатура,
		|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт = &Аккаунт
		|	И рар_мп_Wildberries_СопоставленныеТовары.Баракод = &Баракод"; 
		
		Запрос.УстановитьПараметр("Аккаунт", Объект.рар_мп_АккаунтМаркетплейса);  
		Запрос.УстановитьПараметр("Баракод", Артикул);
		
	КонецЕсли;           
	
	РезультатЗапроса = Запрос.Выполнить();        
	
	Если Не РезультатЗапроса.Пустой() Тогда             
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		МассивЗначенийВыборки = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			МассивЗначенийВыборки.Добавить(Выборка.Номенклатура);
			МассивЗначенийВыборки.Добавить(Выборка.Характеристика);
			МассивЗначенийВыборки.Добавить(Выборка.Упаковка);
			
		КонецЦикла;                      
		
		Возврат МассивЗначенийВыборки;  
		
		
	КонецЕсли; 
	
КонецФункции

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура АртикулПриИзменении(Элемент)
	
	ТекСтрока = Элементы.рар_мп_СписокТоваров.ТекущиеДанные; 
	
	ТекУникЗначение = ТекСтрока.рар_мп_Артикул;   
	
	МассивЗначенийНоменклатуры = ПолучитьНоменклатуруПоАртикулу(ТекУникЗначение);
	
	Если МассивЗначенийНоменклатуры = Неопределено Тогда  
			
		Сообщение = Новый СообщениеПользователю;
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Сообщение.Текст = СтрШаблон("По введенному артикулу подставить номенклатуру, характеристику и упаковку невозможно, " +
		"так как данный артикул не сопоставлен с номенклатурой маркетплейса (Строка: %1)", ТекСтрока.НомерСтроки);
		Сообщение.Сообщить();			                      
		
		ТекСтрока.рар_мп_Номенклатура   = Неопределено; 
		ТекСтрока.рар_мп_Характеристика = Неопределено;
		ТекСтрока.рар_мп_Упаковка       = Неопределено;
		
	ИначеЕсли МассивЗначенийНоменклатуры.Количество() > 3 Тогда
		
		//для вывода баркодов в строку
		СтрокаНоменклатуры = МассивЗначенийНоменклатуры[0];
		
		Для Индекс = 3 По МассивЗначенийНоменклатуры.Количество() - 1 Цикл
			
			СтрокаНоменклатуры = СтрШаблон("%1, %2", СтрокаНоменклатуры, Строка(МассивЗначенийНоменклатуры[Индекс]));  
			
			Индекс = Индекс + 3;
			
		КонецЦикла;
			
		//@skip-check use-non-recommended-method
		Если Найти(СтрокаНоменклатуры, Строка(ТекСтрока.рар_мп_Номенклатура)) И ТекСтрока.рар_мп_Номенклатура <> "" Тогда         
			
			ИндексТекущейНоменклатуры = МассивЗначенийНоменклатуры.Найти(ТекСтрока.рар_мп_Номенклатура); 
			
			ТекСтрока.рар_мп_Характеристика = МассивЗначенийНоменклатуры.Получить(ИндексТекущейНоменклатуры+1);
			ТекСтрока.рар_мп_Упаковка       = МассивЗначенийНоменклатуры.Получить(ИндексТекущейНоменклатуры+2); 
			
		Иначе                                 
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("По данному артикулу существует несколько значений номенклатуры: %1. " + 
			"Пожалуйста, введите один из них, чтобы выбрать определенную номенклатуру.", СтрокаНоменклатуры);
			Сообщение.Сообщить(); 
			
			ТекСтрока.рар_мп_Номенклатура   = Неопределено; 
			ТекСтрока.рар_мп_Характеристика = Неопределено;
			ТекСтрока.рар_мп_Упаковка       = Неопределено;   
			
		КонецЕсли;   
		
		
	Иначе
		
		ТекСтрока.рар_мп_Номенклатура   = МассивЗначенийНоменклатуры[0]; 
		ТекСтрока.рар_мп_Характеристика = МассивЗначенийНоменклатуры[1];
		ТекСтрока.рар_мп_Упаковка       = МассивЗначенийНоменклатуры[2];
		
	КонецЕсли;
	
КонецПроцедуры  

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура БаракодПриИзменении(Элемент)
	
	ТекСтрока = Элементы.рар_мп_СписокТоваров.ТекущиеДанные; 
	
	ТекУникЗначение = ТекСтрока.рар_мп_Баркод;   
	
	МассивЗначенийНоменклатуры = ПолучитьНоменклатуруПоАртикулу(ТекУникЗначение);
	
	Если МассивЗначенийНоменклатуры = Неопределено Тогда  

		Сообщение = Новый СообщениеПользователю;
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Сообщение.Текст = СтрШаблон("По введенному баркоду подставить номенклатуру, характеристику и упаковку невозможно, " +
		"так как данный баркод не сопоставлен с номенклатурой маркетплейса (Строка: %1)", ТекСтрока.НомерСтроки);
		Сообщение.Сообщить();   
		
		ТекСтрока.рар_мп_Номенклатура   = Неопределено; 
		ТекСтрока.рар_мп_Характеристика = Неопределено;
		ТекСтрока.рар_мп_Упаковка       = Неопределено;
		
	ИначеЕсли МассивЗначенийНоменклатуры.Количество() > 3 Тогда
		
		//для вывода баркодов в строку
		СтрокаНоменклатуры = МассивЗначенийНоменклатуры[0];
		
		Для Индекс = 3 По МассивЗначенийНоменклатуры.Количество() - 1 Цикл
			
			СтрокаНоменклатуры = СтрШаблон("%1, %2", СтрокаНоменклатуры, Строка(МассивЗначенийНоменклатуры[Индекс]));  
			
			Индекс = Индекс + 3;
			
		КонецЦикла;
			
		Если СтрНайти(СтрокаНоменклатуры, Строка(ТекСтрока.рар_мп_Номенклатура)) И ЗначениеЗаполнено(ТекСтрока.рар_мп_Номенклатура) Тогда         
			
			ИндексТекущейНоменклатуры = МассивЗначенийНоменклатуры.Найти(ТекСтрока.рар_мп_Номенклатура); 
			
			ТекСтрока.рар_мп_Характеристика = МассивЗначенийНоменклатуры.Получить(ИндексТекущейНоменклатуры+1);
			ТекСтрока.рар_мп_Упаковка       = МассивЗначенийНоменклатуры.Получить(ИндексТекущейНоменклатуры+2); 
			
		Иначе     
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("По данному баркоду существует несколько значений номенклатуры: %1. " + 
			"Пожалуйста, введите один из них, чтобы выбрать определенную номенклатуру.", СтрокаНоменклатуры);
			Сообщение.Сообщить(); 			
			
			ТекСтрока.рар_мп_Номенклатура   = Неопределено; 
			ТекСтрока.рар_мп_Характеристика = Неопределено;
			ТекСтрока.рар_мп_Упаковка       = Неопределено;   
			
		КонецЕсли;    
			
	Иначе
		
		ТекСтрока.рар_мп_Номенклатура   = МассивЗначенийНоменклатуры[0]; 
		ТекСтрока.рар_мп_Характеристика = МассивЗначенийНоменклатуры[1];
		ТекСтрока.рар_мп_Упаковка       = МассивЗначенийНоменклатуры[2];
		
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти     


//@skip-check module-structure-top-region
#Область ИзменениеНоменклатурыВСпискеТоваров

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура рар_мп_СписокТовароврар_мп_НоменклатураПриИзменении(Элемент)    
	
	ТекСтрока = Элементы.рар_мп_СписокТоваров.ТекущиеДанные;    
	
	МассивЗначенийНоменклатуры = ПолучитьБаркодПоНоменклатуре(ТекСтрока.рар_мп_Номенклатура);
	
	Если МассивЗначенийНоменклатуры = Неопределено Тогда
		
		Если ОпределитьТекМаркетплейс_Ozon() Тогда
			
			Сообщение = Новый СообщениеПользователю;
			//@skip-check bsl-legacy-check-dynamic-feature-access
			Сообщение.Текст = СтрШаблон("По введенной номенклатуре подставить артикул, характеристику и упаковку невозможно, " +
			"так как данная номенклатура не сопоставлена с номенклатурой маркетплейса (Строка: %1)", ТекСтрока.НомерСтроки);
			Сообщение.Сообщить();  	
			
			ТекСтрока.рар_мп_Артикул        = Неопределено; 
			ТекСтрока.рар_мп_Характеристика = Неопределено;
			ТекСтрока.рар_мп_Упаковка       = Неопределено;
			
		ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
			
			Сообщение = Новый СообщениеПользователю;
			//@skip-check bsl-legacy-check-dynamic-feature-access
			Сообщение.Текст = СтрШаблон("По введенной номенклатуре подставить баркод, характеристику и упаковку невозможно, " +
			"так как данная номенклатура не сопоставлена с номенклатурой маркетплейса (Строка: %1)", ТекСтрока.НомерСтроки);
			Сообщение.Сообщить();  
			
			ТекСтрока.рар_мп_Баркод         = Неопределено; 
			ТекСтрока.рар_мп_Характеристика = Неопределено;
			ТекСтрока.рар_мп_Упаковка       = Неопределено;
			
		КонецЕсли;   
		
	ИначеЕсли МассивЗначенийНоменклатуры.Количество() > 3 Тогда
		
		//для вывода баркодов в строку
		СтрокаБаркодов = МассивЗначенийНоменклатуры[0];
		
		Для Индекс = 3 По МассивЗначенийНоменклатуры.Количество() - 1 Цикл
			
			СтрокаБаркодов = СтрокаБаркодов + ", " + МассивЗначенийНоменклатуры[Индекс];  
			
			Индекс = Индекс + 3;
			
		КонецЦикла;
		
		
		Если ОпределитьТекМаркетплейс_Ozon() Тогда
			
			//@skip-check use-non-recommended-method
			Если Найти(СтрокаБаркодов, ТекСтрока.рар_мп_Артикул)  И ТекСтрока.рар_мп_Артикул <> "" Тогда         
				
				ИндексТекущегоАртикула = МассивЗначенийНоменклатуры.Найти(ТекСтрока.рар_мп_Артикул); 
				
				ТекСтрока.рар_мп_Характеристика = МассивЗначенийНоменклатуры.Получить(ИндексТекущегоАртикула+1);
				ТекСтрока.рар_мп_Упаковка       = МассивЗначенийНоменклатуры.Получить(ИндексТекущегоАртикула+2); 
				
			Иначе                                 
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("По данной номенклатуре существует несколько значений артикула: %1. " + 
				"Пожалуйста, введите один из них, чтобы выбрать определенную номенклатуру.", СтрокаБаркодов);
				Сообщение.Сообщить(); 
				
				ТекСтрока.рар_мп_Артикул        = Неопределено; 
				ТекСтрока.рар_мп_Характеристика = Неопределено;
				ТекСтрока.рар_мп_Упаковка       = Неопределено;   
				
			КонецЕсли;   
			
		ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
			
			Если СтрНайти(СтрокаБаркодов, ТекСтрока.рар_мп_Баркод) И ТекСтрока.рар_мп_Баркод <> "" Тогда         
				
				ИндексТекущегоБаркода = МассивЗначенийНоменклатуры.Найти(ТекСтрока.рар_мп_Баркод); 
				
				ТекСтрока.рар_мп_Характеристика = МассивЗначенийНоменклатуры.Получить(ИндексТекущегоБаркода+1);
				ТекСтрока.рар_мп_Упаковка       = МассивЗначенийНоменклатуры.Получить(ИндексТекущегоБаркода+2); 
				
			Иначе     
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("По данной номенклатуре существует несколько значений баркода: %1. " + 
				"Пожалуйста, введите один из них, чтобы выбрать определенную номенклатуру.", СтрокаБаркодов);
				Сообщение.Сообщить(); 			
				
				ТекСтрока.рар_мп_Баркод         = Неопределено; 
				ТекСтрока.рар_мп_Характеристика = Неопределено;
				ТекСтрока.рар_мп_Упаковка       = Неопределено;   
				
			КонецЕсли;    
			
		КонецЕсли;
		
		
	Иначе
		
		Если ОпределитьТекМаркетплейс_Ozon() Тогда
			
			ТекСтрока.рар_мп_Артикул        = МассивЗначенийНоменклатуры[0]; 
			ТекСтрока.рар_мп_Характеристика = МассивЗначенийНоменклатуры[1];
			ТекСтрока.рар_мп_Упаковка       = МассивЗначенийНоменклатуры[2];
			
		ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
			
			ТекСтрока.рар_мп_Баркод         = МассивЗначенийНоменклатуры[0];
			ТекСтрока.рар_мп_Характеристика = МассивЗначенийНоменклатуры[1];
			ТекСтрока.рар_мп_Упаковка       = МассивЗначенийНоменклатуры[2];
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьБаркодПоНоменклатуре(Номенклатура)
	
	Если ОпределитьТекМаркетплейс_Ozon() Тогда 
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Ozon_СопоставленныеТовары.Артикул КАК Баракод,
		|	рар_мп_Ozon_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Ozon_СопоставленныеТовары.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.рар_мп_Ozon_СопоставленныеТовары КАК рар_мп_Ozon_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Ozon_СопоставленныеТовары.Аккаунт = &Аккаунт
		|	И рар_мп_Ozon_СопоставленныеТовары.Номенклатура = &Номенклатура"; 
		
		Запрос.УстановитьПараметр("Аккаунт", Объект.рар_мп_АккаунтМаркетплейса);  
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);	
		
	ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	рар_мп_Wildberries_СопоставленныеТовары.Баракод КАК Баракод,
		|	рар_мп_Wildberries_СопоставленныеТовары.Характеристика КАК Характеристика,
		|	рар_мп_Wildberries_СопоставленныеТовары.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.рар_мп_Wildberries_СопоставленныеТовары КАК рар_мп_Wildberries_СопоставленныеТовары
		|ГДЕ
		|	рар_мп_Wildberries_СопоставленныеТовары.Аккаунт = &Аккаунт
		|	И рар_мп_Wildberries_СопоставленныеТовары.Номенклатура = &Номенклатура";     
		
		Запрос.УстановитьПараметр("Аккаунт", Объект.рар_мп_АккаунтМаркетплейса);  
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
	КонецЕсли;       
	
	РезультатЗапроса = Запрос.Выполнить();        
	
	Если Не РезультатЗапроса.Пустой() Тогда             
		
		Выборка = РезультатЗапроса.Выбрать();   
		
		МассивЗначенийВыборки = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			МассивЗначенийВыборки.Добавить(Выборка.Баракод);
			МассивЗначенийВыборки.Добавить(Выборка.Характеристика);
			МассивЗначенийВыборки.Добавить(Выборка.Упаковка);
			
		КонецЦикла;   
		
		Возврат МассивЗначенийВыборки;  		
	КонецЕсли;
	
	
КонецФункции

#КонецОбласти


//@skip-check module-structure-top-region
#Область КнопкаПодбораНоменклатуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура Подбор(Команда)
	
	Если ЗначениеЗаполнено(Объект.рар_мп_АккаунтМаркетплейса) Тогда              
		
		Если ЗначениеЗаполнено(Объект.рар_мп_Склад) Тогда     
			
			Если Не ПроверкаОстатковТоваров() Тогда
				
				СвернутьТЧСписокТоваров();
				
				//Создаем структуру с отбором и добавляем значения
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("Аккаунт", Объект.рар_мп_АккаунтМаркетплейса); 
				ПараметрыФормы.Вставить("Склад", Объект.рар_мп_Склад);
				ПараметрыФормы.Вставить("СписокТоваров", Объект.рар_мп_СписокТоваров);
				
				//@skip-check form-self-reference
				ОткрытьФорму("Обработка.рар_мп_ПодготовкаФайловПоставки_ПодборНоменклатуры.Форма.ФормаПодбора", ПараметрыФормы, ЭтаФорма);
				
			КонецЕсли;			
			
		Иначе
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для того, чтобы открыть подбор номенклатуры, заполните поле ""Склад"".");
			
		КонецЕсли;
		
	Иначе                                                            
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для того, чтобы открыть подбор номенклатуры, заполните поле ""Аккаунт маркетплейса"".");
		
	КонецЕсли;   	
КонецПроцедуры

&НаКлиенте                                                                                                  
Процедура ОбработатьПодбор(АдресВХ) Экспорт
	
	ОбработатьПодборНаСервере(АдресВХ);
	Модифицированность = Истина;
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьПодборНаСервере(АдресВХ)
	
	НоменклатураИзПодбора = ПолучитьИзВременногоХранилища(АдресВХ); 
	
	ТЧ_СпискаТоваров = Объект.рар_мп_СписокТоваров.Выгрузить(); 
	
	Если ОпределитьТекМаркетплейс_Ozon() Тогда
		
		ТЧ_СпискаТоваров.Свернуть("рар_мп_Артикул, рар_мп_Номенклатура, рар_мп_Характеристика, рар_мп_Упаковка", "рар_мп_Количество");
		
	ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
		
		ТЧ_СпискаТоваров.Свернуть("рар_мп_Баркод, рар_мп_Номенклатура, рар_мп_Характеристика, рар_мп_Упаковка", "рар_мп_Количество");
		
	ИначеЕсли ОпределитьТекМаркетплейс_ЯндексМаркет() Тогда
		
		//Код ЯндексМаркета
		
	КонецЕсли;
	
	Если НоменклатураИзПодбора.Количество() > 0 Тогда
		
		Для каждого Элем из НоменклатураИзПодбора Цикл 
			
			СтруктураВыбранныеТовары = Новый Структура();
			СтруктураВыбранныеТовары.Вставить("рар_мп_Номенклатура", Элем.Номенклатура);
			СтруктураВыбранныеТовары.Вставить("рар_мп_Упаковка", Элем.Упаковка);
			СтруктураВыбранныеТовары.Вставить("рар_мп_Характеристика", Элем.Характеристика);
			
			Если ТЧ_СпискаТоваров.НайтиСтроки(СтруктураВыбранныеТовары).Количество() = 0 Тогда
				
				НоваяСтрока = ТЧ_СпискаТоваров.Добавить();
				НоваяСтрока.рар_мп_Номенклатура	  = Элем.Номенклатура; 
				НоваяСтрока.рар_мп_Упаковка		  = Элем.Упаковка;
				НоваяСтрока.рар_мп_Характеристика = Элем.Характеристика;
				НоваяСтрока.рар_мп_Количество	  = Элем.Количество;
				
				Если ОпределитьТекМаркетплейс_Ozon() Тогда
					
					НоваяСтрока.рар_мп_Артикул = Элем.Артикул;   
					
				ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
					
					НоваяСтрока.рар_мп_Баркод = Элем.Артикул; 
					
				ИначеЕсли ОпределитьТекМаркетплейс_ЯндексМаркет() Тогда
					
					//Обработка для ЯндексМаркета
					
				КонецЕсли;
				
			ИначеЕсли ТЧ_СпискаТоваров.НайтиСтроки(СтруктураВыбранныеТовары).Количество() <> 0 Тогда
				
				СущНоменклатура = ТЧ_СпискаТоваров.НайтиСтроки(СтруктураВыбранныеТовары); 
				
				Для каждого Строка_СпискаТоваров из СущНоменклатура Цикл
					
					Строка_СпискаТоваров.рар_мп_Количество = Элем.Количество;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Объект.рар_мп_СписокТоваров.Загрузить(ТЧ_СпискаТоваров);
	
КонецПроцедуры  

#КонецОбласти    


//@skip-check module-structure-top-region
#Область СозданиеExcelФайла

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура СоздатьExcelФайл(Команда)
	
	Если ЗначениеЗаполнено(Объект.рар_мп_АккаунтМаркетплейса) Тогда  
		
		Если ОпределитьТекМаркетплейс_ЯндексМаркет() Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данный функционал недоступен для Яндекс маркета";
			Сообщение.Сообщить();  
			
		Иначе
			Если Объект.рар_мп_СписокТоваров.Количество() > 0 Тогда  
				
				НеСоздаватьЭксельФайл = Ложь;
				
				Для каждого Строка Из Объект.рар_мп_СписокТоваров Цикл
					
					Если Строка.рар_мп_Количество = 0 Тогда
						
						Сообщение = Новый СообщениеПользователю;
						//@skip-check bsl-legacy-check-dynamic-feature-access
						Сообщение.Текст = "Ошибка создания Excel файла. Введите количество товара в строке " + Строка.НомерСтроки;
						Сообщение.Сообщить();  
						
						НеСоздаватьЭксельФайл = Истина;
						
					КонецЕсли;  
					
					Если ОпределитьТекМаркетплейс_Ozon() Тогда
						
						Если Строка.рар_мп_Артикул = "" Тогда
							
							Сообщение = Новый СообщениеПользователю;
							//@skip-check bsl-legacy-check-dynamic-feature-access
							Сообщение.Текст = "Ошибка создания Excel файла. Введите артикул в строке " + Строка.НомерСтроки;
							Сообщение.Сообщить();  
							
							НеСоздаватьЭксельФайл = Истина;
							
						КонецЕсли;      
						
					ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
						
						Если Строка.рар_мп_Баркод = "" Тогда
							
							Сообщение = Новый СообщениеПользователю;
							//@skip-check bsl-legacy-check-dynamic-feature-access
							Сообщение.Текст = "Ошибка создания Excel файла. Введите баркод в строке " + Строка.НомерСтроки;
							Сообщение.Сообщить();  
							
							НеСоздаватьЭксельФайл = Истина;
							
						КонецЕсли;      
						
					КонецЕсли;
					
				КонецЦикла;  
				
				Если Не НеСоздаватьЭксельФайл И Не ПроверкаОстатковТоваров() Тогда
					
					ДлительнаяОперация = СоздатьExcelФайлНаСервере();
					
					ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
					ПараметрыОжидания.ВыводитьОкноОжидания = Истина;  
					ПараметрыОжидания.Заголовок = "Создание Excel файла";
					Оповещение = Новый ОписаниеОповещения("ПриЗавершенииСозданияФайлаExcel", ЭтотОбъект);
					ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
					
				КонецЕсли;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка создания Excel файла. Нет данных в списке товаров";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка создания Excel файла. Не заполнен аккаунт маркетплейса.";
		Сообщение.Сообщить();                      
		
	КонецЕсли;  
	
КонецПроцедуры        

&НаКлиенте
Процедура ПриЗавершенииСозданияФайлаExcel(РезультатИзВремХран, ДопПараметры) Экспорт
	
	Если РезультатИзВремХран = Неопределено Тогда  // пользователь отменил задание
		Возврат;
	КонецЕсли;
	
	Если РезультатИзВремХран.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатИзВремХран.ПодробноеПредставлениеОшибки;
	КонецЕсли;     
	
	Если ПолучитьИзВременногоХранилища(РезультатИзВремХран.АдресРезультата) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл Excel с товарами успешно создан.";
		Сообщение.Сообщить();     
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =  "Файл Excel не создан. Описание ошибки в журнале регистрации.";
		Сообщение.Сообщить();     
		
	КонецЕсли;
	
	
КонецПроцедуры

//@skip-check export-method-in-command-form-module
//@skip-check doc-comment-export-function-return-section
&НаСервере
Функция СоздатьExcelФайлНаСервере() Экспорт   
	
	//@skip-check form-self-reference
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);  
	СвернутьТЧСписокТоваров();
	
	Если ОпределитьТекМаркетплейс_Ozon() Тогда
		
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ФормированиеПоставки.СформироватьExcelСпискаТоваров_Ozon", Объект.рар_мп_СписокТоваров.Выгрузить());
		
	ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
		
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ФормированиеПоставки.СформироватьExcelСпискаТоваров_Wildberries", Объект.рар_мп_СписокТоваров.Выгрузить());
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

//@skip-check module-structure-top-region
#Область СозданиеExcelФайлаСРаспределеннымиТоварами

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура СоздатьExcelФайлСРаспределеннымиТоварами(Команда)
	
	Если ЗначениеЗаполнено(Объект.рар_мп_АккаунтМаркетплейса) Тогда
		
		Если Объект.рар_мп_РаспределенныеТовары.Количество() > 0 Тогда  
			
			Если Объект.рар_мп_ТоварыИзЗаказов.Количество() > 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка создания Excel файла. Не все товары распределены по коробкам";
				Сообщение.Сообщить();
				
			Иначе
				
				ДлительнаяОперация = СоздатьExcelФайлСРаспределеннымиТоварамиНаСервере();
				
				ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
				ПараметрыОжидания.ВыводитьОкноОжидания = Истина;  
				ПараметрыОжидания.Заголовок = "Создание Excel файла";
				Оповещение = Новый ОписаниеОповещения("ПриЗавершенииСозданияФайлаExcelСРаспределеннымиТоварами", ЭтотОбъект);
				ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
				
				
			КонецЕсли;
			
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка создания Excel файла. Нет данных в распределенных товарах";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка создания Excel файла. Не заполнен аккаунт маркетплейса.";
		Сообщение.Сообщить();                      
		
	КонецЕсли;  
	
КонецПроцедуры        

&НаКлиенте
Процедура ПриЗавершенииСозданияФайлаExcelСРаспределеннымиТоварами(РезультатИзВремХран, ДопПараметры) Экспорт
	
	Если РезультатИзВремХран = Неопределено Тогда  // пользователь отменил задание
		Возврат;
	КонецЕсли;
	
	Если РезультатИзВремХран.Статус = "Ошибка" Тогда
		ВызватьИсключение РезультатИзВремХран.ПодробноеПредставлениеОшибки;
	КонецЕсли;     
	
	Если ПолучитьИзВременногоХранилища(РезультатИзВремХран.АдресРезультата) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл Excel с товарами успешно создан.";
		Сообщение.Сообщить();     
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст =  "Файл Excel не создан. Описание ошибки в журнале регистрации.";
		Сообщение.Сообщить();   
		
		
	КонецЕсли;
	
	
КонецПроцедуры

//@skip-check export-method-in-command-form-module
//@skip-check doc-comment-export-function-return-section
&НаСервере
Функция СоздатьExcelФайлСРаспределеннымиТоварамиНаСервере() Экспорт   
	
	//@skip-check form-self-reference
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);              
	
	Если ОпределитьТекМаркетплейс_Wildberries() Тогда
		
		Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "рар_мп_ФормированиеПоставки.СформироватьExcelРаспределенныхТоваров_Wildberries", Объект.рар_мп_РаспределенныеТовары.Выгрузить());
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти


//@skip-check module-structure-top-region
#Область ПроверкаОстатковТоваров   

&НаСервере
Функция ПроверкаОстатковТоваров() 
	
	СвернутьТЧСписокТоваров();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Склад КАК Склад,
	|	вт_ТЧТовары.рар_мп_Номенклатура КАК рар_мп_Номенклатура,
	|	вт_ТЧТовары.рар_мп_Количество КАК рар_мп_Количество,
	|	вт_ТЧТовары.рар_мп_Характеристика КАК рар_мп_Характеристика
	|ПОМЕСТИТЬ вт_ТЧТовары
	|ИЗ
	|	&вт_ТЧТовары КАК вт_ТЧТовары
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	рар_мп_Номенклатура,
	|	Склад,
	|	рар_мп_Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
	|	вт_ТЧТовары.рар_мп_Номенклатура КАК Номенклатура,
	|	вт_ТЧТовары.рар_мп_Количество КАК Количество,
	|	вт_ТЧТовары.рар_мп_Характеристика КАК Характеристика,
	|	вт_ТЧТовары.Склад КАК Склад
	|ИЗ
	|	вт_ТЧТовары КАК вт_ТЧТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Период,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.рар_мп_Номенклатура КАК Номенклатура
	|						ИЗ
	|							вт_ТЧТовары КАК Товары)
	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО вт_ТЧТовары.рар_мп_Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И вт_ТЧТовары.рар_мп_Характеристика = ТоварыНаСкладахОстатки.Характеристика";
	
	Запрос.УстановитьПараметр("Склад", Объект.рар_мп_Склад);
	Запрос.УстановитьПараметр("вт_ТЧТовары", Объект.рар_мп_СписокТоваров.Выгрузить());
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();   
	
	НеСоздаватьФайл = Ложь;
	
	Пока Выборка.Следующий() Цикл 
		
		НедостатокТовара = Выборка.Количество - Выборка.ВНаличииОстаток;
		
		Если НедостатокТовара > 0 Тогда
			
			НеСоздаватьФайл = Истина;  
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Контроль остатков товаров. Товара %1 с характеристикой %2 недостаточно в количестве %3 шт. на складе %4", 
			Выборка.Номенклатура, Выборка.Характеристика, НедостатокТовара, Выборка.Склад);
			Сообщение.Сообщить();
			
		КонецЕсли;                   
		
		Если НеСоздаватьФайл Тогда
			
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Возврат НеСоздаватьФайл;
	
	
КонецФункции

#КонецОбласти


//@skip-check module-structure-top-region
#Область ОбновлениеТЧДляКоробок

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ОбновитьТЧ(Команда)  
	
	Если Не ПроверкаОстатковТоваров() Тогда    
		
		Оповещение   = Новый ОписаниеОповещения("ОбновитьТЧЗавершение", ЭтотОбъект);		
		ТекстВопроса = НСтр("ru = 'При обновлении будут очищены текущая табличная часть и табличная часть распределенных товаров. 
		|Продолжить?'");							 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);   
		
		
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура ОбновитьТЧЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.рар_мп_ТоварыИзЗаказов.Очистить();   
		Объект.рар_мп_РаспределенныеТовары.Очистить();
		СвернутьТЧСписокТоваров();
		
		Для каждого Строка Из Объект.рар_мп_СписокТоваров Цикл
			
			Если (ЗначениеЗаполнено(Строка.рар_мп_Баркод) ИЛИ ЗначениеЗаполнено(Строка.рар_мп_Артикул)) 
				И ЗначениеЗаполнено(Строка.рар_мп_Номенклатура) И ЗначениеЗаполнено(Строка.рар_мп_Характеристика)
				И ЗначениеЗаполнено(Строка.рар_мп_Упаковка) И ЗначениеЗаполнено(Строка.рар_мп_Количество) Тогда
				
				НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				//@skip-check bsl-legacy-check-dynamic-feature-access
				Сообщение.Текст = СтрШаблон("Строка %1 не заполнена до конца. Пожалуйста, дозаполните строку и обновите табличную часть повторно.", Строка.НомерСтроки);
				Сообщение.Сообщить();
				
			КонецЕсли;		
		КонецЦикла;  
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

//@skip-check module-structure-top-region
#Область ДобавлениеВКоробку

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ДобавитьВКоробку(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ДобавитьВКоробкуНаСервере();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВКоробкуНаСервере()
	
	Если ОпределитьТекМаркетплейс_ЯндексМаркет() Или
		ОпределитьТекМаркетплейс_Ozon() Тогда
		
		
	ИначеЕсли ОпределитьТекМаркетплейс_Wildberries() Тогда
		
		ВыбраннаяКоробка = Объект.рар_мп_Коробки.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
		
		Если ВыбраннаяКоробка.Количество() > 0 Тогда
			
			НужнаяКоробка = ВыбраннаяКоробка.Получить(0);
			
			ВыбранныеСтроки = Объект.рар_мп_ТоварыИзЗаказов.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
			
			Если ВыбранныеСтроки.Количество() > 0 Тогда
				
				Для каждого Строка Из ВыбранныеСтроки Цикл
					
					НоваяСтрока = Объект.рар_мп_РаспределенныеТовары.Добавить();
					
					НоваяСтрока.рар_мп_Коробка			    = НужнаяКоробка.рар_мп_Коробка;
					НоваяСтрока.рар_мп_Баркод               = Строка.рар_мп_Баркод;
					НоваяСтрока.рар_мп_Номенклатура         = Строка.рар_мп_Номенклатура;
					НоваяСтрока.рар_мп_Характеристика       = Строка.рар_мп_Характеристика;  
					НоваяСтрока.рар_мп_Упаковка             = Строка.рар_мп_Упаковка;
					НоваяСтрока.рар_мп_Количество			= Строка.рар_мп_Количество;
					
					Объект.рар_мп_ТоварыИзЗаказов.Удалить(Объект.рар_мп_ТоварыИзЗаказов.Индекс(Строка));		
					
				КонецЦикла;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Добавление в коробку завершено";
				Сообщение.Сообщить();
				
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для добавления в коробку необходимо выбрать заказы (отметить строку галочкой)";
				Сообщение.Сообщить();	
				
			КонецЕсли;
			
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для добавления в коробку необходимо выбрать коробку (отметить строку галочкой)";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти     


//@skip-check module-structure-top-region
#Область УдалениеИзКоробки

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура УдалитьИзКоробки(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ВыбранныеСтроки = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
		
		Если ВыбранныеСтроки.Количество() > 0 Тогда
			
			Если ОпределитьТекМаркетплейс_Wildberries() Тогда
				
				Wildberries_УдалитьИзКоробкиНаСервере();	
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для данного аккаунта нельзя удалять коробки";
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Для удаления из коробки необходимо выбрать заказы (отметить строку галочкой)";
			Сообщение.Сообщить();
			
		КонецЕсли; 
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Wildberries_УдалитьИзКоробкиНаСервере()
	
	ВыбранныеСтроки = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));
	
	НужныеСтроки = Объект.рар_мп_РаспределенныеТовары.Выгрузить(ВыбранныеСтроки);
	
	Для каждого Строка Из НужныеСтроки Цикл
		
		НоваяСтрока = Объект.рар_мп_ТоварыИзЗаказов.Добавить();
		
		НоваяСтрока.рар_мп_Баркод               = Строка.рар_мп_Баркод;
		НоваяСтрока.рар_мп_Номенклатура         = Строка.рар_мп_Номенклатура;
		НоваяСтрока.рар_мп_Характеристика       = Строка.рар_мп_Характеристика;   
		НоваяСтрока.рар_мп_Упаковка             = Строка.рар_мп_Упаковка;
		НоваяСтрока.рар_мп_Количество			= Строка.рар_мп_Количество;
		
		//@skip-check structure-consructor-too-many-keys
		СтуктураПоискаСтроки = Новый Структура("рар_мп_Коробка, рар_мп_Номенклатура,рар_мп_Характеристика, рар_мп_Упаковка, рар_мп_Баркод", 
		Строка.рар_мп_Коробка, Строка.рар_мп_Номенклатура, 
		Строка.рар_мп_Характеристика, Строка.рар_мп_Упаковка, Строка.рар_мп_Баркод);		
		НужнаяСтрока = Объект.рар_мп_РаспределенныеТовары.НайтиСтроки(СтуктураПоискаСтроки);
		
		Если НужнаяСтрока.Количество() <> 0 Тогда
			
			Объект.рар_мп_РаспределенныеТовары.Удалить(Объект.рар_мп_РаспределенныеТовары.Индекс(НужнаяСтрока.Получить(0)));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Удаление из коробки завершено";
	Сообщение.Сообщить();	
	
КонецПроцедуры

#КонецОбласти    

//@skip-check module-structure-top-region
#Область РазделениеТовара

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура РазделитьТовар(Команда)
	ВыбранныйТовар = Объект.рар_мп_ТоварыИзЗаказов.НайтиСтроки(Новый Структура("ВыборСтроки", Истина));    
	
	Если ВыбранныйТовар.Количество() > 0 Тогда
		
		Если ВыбранныйТовар.Количество() > 1 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Выбрано несколько товаров. Для разделения товара необходимо выбрать только один товар";
			Сообщение.Сообщить();
			
		Иначе        
			
			Если ВыбранныйТовар[0].рар_мп_Количество = 0 Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Для разделения выбран товар с нулевым количеством. Пожалуста, укажите количество выбранного товара";
				Сообщение.Сообщить();
				
			Иначе
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("Баркод", ВыбранныйТовар[0].рар_мп_Баркод);
				СтруктураПараметров.Вставить("Номенклатура", ВыбранныйТовар[0].рар_мп_Номенклатура);
				СтруктураПараметров.Вставить("Характеристика", ВыбранныйТовар[0].рар_мп_Характеристика);
				СтруктураПараметров.Вставить("Упаковка", ВыбранныйТовар[0].рар_мп_Упаковка);
				СтруктураПараметров.Вставить("Количество", ВыбранныйТовар[0].рар_мп_Количество);
				
				//@skip-check form-self-reference
				ОткрытьФорму("Документ.рар_мп_ПодготовкаФайловПоставки.Форма.ФормаРазделенияТовара", СтруктураПараметров, ЭтаФорма);
				
			КонецЕсли;
			
		КонецЕсли;
		
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для разделения товара необходимо выбрать товар (отметить строку галочкой)";
		Сообщение.Сообщить();
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


//@skip-check module-structure-top-region
#Область ДобавлениеШтрихкодовКоробок

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ПутьКФайлу_ШтрихкодНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)     
	
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбора = Новый ДиалогВыбораФайла(Режим);
	
	ДиалогВыбора.ПолноеИмяФайла = "";
	ДиалогВыбора.Фильтр = "Книга Excel (*.xlsx; *.xls) | *.xlsx; *.xls";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Заголовок = "Выберите файл Excel формата";
	
	ДиалогВыбора.Показать(Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбора", ДиалогВыбора))); 
	
КонецПроцедуры           

//@skip-check module-structure-form-event-regions
//@skip-check doc-comment-parameter-section
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	ДиалогВыбора = ДополнительныеПараметры.ДиалогВыбора;
	
	Если ВыбранныеФайлы <> Неопределено Тогда 
		
		ПутьКФайлу_Штрихкод = ДиалогВыбора.ПолноеИмяФайла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьШтрихкодыНаСервере()   
	
	Объект.рар_мп_Коробки.Очистить();
	
	ТабДок = Новый ТабличныйДокумент;
	
	Попытка
		
		ТабДок.Прочитать(ПутьКФайлу_Штрихкод);
		
	Исключение       
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл с штрихкодами коробов. Описание ошибки в журнале регистрации";
		Сообщение.Сообщить();
		
		Комментарий = СтрШаблон("Не удалось прочитать файл с штрихкодами коробов. Описание ошибки: %1", ОписаниеОшибки());
		ЗаписьЖурналаРегистрации("Ошибка при удалении", УровеньЖурналаРегистрации.Ошибка, , , Комментарий, );
		
		Возврат;
	КонецПопытки;  
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	//КоличествоКолонок = ТабДок.ШиринаТаблицы;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		Если НомерСтроки = 1 Тогда
			
			Продолжить;
			
		КонецЕсли;     
		
		НоваяСтрока = Объект.рар_мп_Коробки.Добавить();
		НоваяСтрока.рар_мп_Коробка = ТабДок.Область(НомерСтроки, 3).Текст;
		
	КонецЦикла;    
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Штрихкоды коробов успешно загружены.";
	Сообщение.Сообщить();
	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура ЗагрузитьШтрихкоды(Команда)
	Если Не ЗначениеЗаполнено(ПутьКФайлу_Штрихкод) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка загрузки штрихкодов коробов. Укажите путь к файлу с штрихкодами коробов.";
		Сообщение.Сообщить();   
		
	Иначе
		
		ЗагрузитьШтрихкодыНаСервере();
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

//@skip-check module-structure-top-region
#Область ФормированиеДокументаРеализации

&НаСервере
Процедура СформироватьДокументРеализацииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.рар_мп_Реализация) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Передача на комиссию уже создана для данного документа.";
		Сообщение.Сообщить();
		
	Иначе
		
		Если Не ПроверкаОстатковТоваров() Тогда
			
			РеквизитыАккаунта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.рар_мп_АккаунтМаркетплейса, 
									"Организация, Контрагент, ОперацияПередачаНаКомиссию, Соглашение, Договор, Валюта, Менеджер, Подразделение");
			ОперацияПередачаНаКомиссию = РеквизитыАккаунта.ОперацияПередачаНаКомиссию;
			Организация 			   = РеквизитыАккаунта.Организация;
			Контрагент 				   = РеквизитыАккаунта.Контрагент;
			Соглашение 				   = РеквизитыАккаунта.Соглашение;
			Договор 				   = РеквизитыАккаунта.Договор;
			Валюта 					   = РеквизитыАккаунта.Валюта;
			Менеджер 				   = РеквизитыАккаунта.Менеджер;
			Подразделение 			   = РеквизитыАккаунта.Подразделение;
			
			НовыйДокумент = Документы.ПередачаТоваровХранителю.СоздатьДокумент();               
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.ХозяйственнаяОперация = ОперацияПередачаНаКомиссию; 
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Склад              	= Объект.рар_мп_Склад;
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Организация           = Организация;   
			НовыйДокумент.Дата 					= ТекущаяДатаСеанса();
			//@skip-check reading-attribute-from-database
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Партнер 				= Контрагент.Партнер;
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Контрагент 			= Контрагент;
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Соглашение 			= Соглашение;
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Договор 				= Договор;
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Валюта 				= Валюта;
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Менеджер				= Менеджер;
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.Подразделение			= Подразделение;  
			//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
			НовыйДокумент.СпособДоставки        = Перечисления.СпособыДоставки.Самовывоз;   
			
			
			
			Для каждого Товар Из Объект.рар_мп_СписокТоваров Цикл
				
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				
				//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
				НоваяСтрока.Номенклатура       = Товар.рар_мп_Номенклатура;
				//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
				НоваяСтрока.Характеристика     = Товар.рар_мп_Характеристика;
				//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
				НоваяСтрока.Упаковка           = Товар.рар_мп_Упаковка;
				//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
				НоваяСтрока.КоличествоУпаковок = Товар.рар_мп_Количество; 
				//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part
				НоваяСтрока.Склад              = Объект.рар_мп_Склад;
				
			КонецЦикла;
			
			Попытка
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);  
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Создание передачи на комиссию завершено";
				Сообщение.Сообщить();
				
				
			Исключение
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка при проведении документа 'Передача на комиссию'. Описание ошибки в журнале регистрации.";
				Сообщение.Сообщить();
				
				Комментарий = СтрШаблон("Аккаунт: %1, Описание ошибки: %2",
				Объект.рар_мп_АккаунтМаркетплейса, ОписаниеОшибки());
				
				ЗаписьЖурналаРегистрации("Ошибка при проведении документа 'Передача на комиссию'", УровеньЖурналаРегистрации.Ошибка,,Объект.рар_мп_АккаунтМаркетплейса,Комментарий,);
				
			КонецПопытки;      
			
			Объект.рар_мп_Реализация = НовыйДокумент.Ссылка;
			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

//@skip-check module-structure-form-event-regions
&НаКлиенте
Процедура СформироватьДокументРеализации(Команда)   
	
	Если ОпределитьТекМаркетплейс_ЯндексМаркет() Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данный функционал недоступен для Яндекс маркета";
		Сообщение.Сообщить();      
		
	Иначе
		
		СвернутьТЧСписокТоваров();
		СформироватьДокументРеализацииНаСервере();
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти                      

//@skip-check module-structure-top-region
#Область СвернутьТЧ
&НаСервере
Процедура СвернутьТЧСписокТоваров()
	
	ТЗ_Товаров = Объект.рар_мп_СписокТоваров.Выгрузить();
	ТЗ_Товаров.Свернуть("рар_мп_Артикул, рар_мп_Баркод, рар_мп_Номенклатура, рар_мп_Характеристика, рар_мп_Упаковка", "рар_мп_Количество");
	Объект.рар_мп_СписокТоваров.Загрузить(ТЗ_Товаров);
КонецПроцедуры	
#КонецОбласти
